import React from "react";

import styles from "./AboutUs.module.scss";
import AnimatedBlobImage from "components/AnimatedBlobImage/AnimatedBlobImage";

type Props = {};

function AboutUs(props: Props) {
  const {} = props;

  return (
    <section className={styles["about-us-wrapper"]}>
      <div className={styles["about-us-content"]}>
        <h3 className={styles["title"]}>אודיתינו</h3>
        <div className={styles["content"]}>
          <p className={styles["about-us-text"]}>
            לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס
            סאפיאן - פוסיליס קוויס, אקווזמן לורם איפסום דולור סיט אמט, קונסקטורר
            אדיפיסינג אלית. סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם.
            וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום
            בעליק. הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך וחאית
            נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש, כאנה ניצאחו נמרגי שהכים
            תוק, הדש שנרא התידם הכייר וק. צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו
            בלוקריה שיצמה ברורק. קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח.
            עמחליף הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך וחאית
            נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש, כאנה ניצאחו נמרגי שהכים
            תוק, הדש שנרא התידם הכייר וק. הועניב היושבב שערש שמחויט - שלושע
            ותלברו חשלו שעותלשך וחאית נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש,
            כאנה ניצאחו נמרגי שהכים תוק, הדש שנרא התידם הכייר וק. מוסן מנת.
            להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך. גולר מונפרר סוברט
            לורם שבצק יהול, לכנוץ בעריר גק ליץ, קולהע צופעט למרקוח איבן איף,
            ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק. תצטנפל בלינדו למרקל אס
            לכימפו, דול, צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור
            ליאמום בלינך רוגצה. לפמעט לורם איפסום דולור סיט אמט, קונסקטורר
            אדיפיסינג אלית. סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם.
            וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום
            בעליק. קונדימנטום קורוס בליקרה, נונסטי קלובר בריקנה סטום, לפריקך
            תצטריק לרטי. קונסקטורר אדיפיסינג אלית. סת אלמנקום ניסי נון ניבאה. דס
            איאקוליס וולופטה דיאם. וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו
            וסטיבולום סוליסי טידום בעליק. קונדימנטום קורוס בליקרה, נונסטי קלובר
            בריקנה סטום, לפריקך תצטריק לרטי. קוואזי במר מודוף. אודיפו בלאסטיק
            מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לפרומי בלוף קינץ תתיח
            לרעח. לת צשחמי צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה
            ברורק. נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף.
            אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לפרומי בלוף
            קינץ תתיח לרעח. לת צשחמי קולהע צופעט למרקוח איבן איף, ברומץ כלרשט
            מיחוצים. קלאצי
          </p>
          <div className={styles["image-wrapper"]}>
            <AnimatedBlobImage />
          </div>
        </div>
      </div>
    </section>
  );
}

export default AboutUs;
